package ebiten_container

func (g *ChessBoardService) initBoard() {
	g.board = [10][9]string{
		{"車", "馬", "象", "士", "將", "士", "象", "馬", "車"}, // Hàng 0: Quân Đen
		{"", "", "", "", "", "", "", "", ""},
		{"", "砲", "", "", "", "", "", "砲", ""},    // Pháo Đen
		{"卒", "", "卒", "", "卒", "", "卒", "", "卒"}, // Tốt Đen
		{"", "", "", "", "", "", "", "", ""},
		{"", "", "", "", "", "", "", "", ""},      // Sông
		{"兵", "", "兵", "", "兵", "", "兵", "", "兵"}, // Tốt Đỏ
		{"", "炮", "", "", "", "", "", "炮", ""},    // Pháo Đỏ
		{"", "", "", "", "", "", "", "", ""},
		{"俥", "傌", "相", "士", "帥", "士", "相", "傌", "俥"}, // Hàng 9: Quân Đỏ
	}
}
